doc/lwjgl-clj.org
#+OPTIONS: ':nil *:t -:t ::t <:t H:3 \n:nil ^:t arch:headline author:t
#+OPTIONS: broken-links:nil c:nil creator:nil d:(not "LOGBOOK") date:t e:t
#+OPTIONS: email:nil f:t inline:t num:t p:nil pri:nil prop:nil stat:t tags:t
#+OPTIONS: tasks:t tex:t timestamp:t title:t toc:t todo:t |:t
#+TITLE: LWJGL と OpenCV を Clojure で書いていく
#+DATE: <2018-04-17 火>
#+AUTHOR: Mokke Meguru 
#+EMAIL: 
#+LANGUAGE: en
#+SELECT_TAGS: export
#+EXCLUDE_TAGS: noexport
#+CREATOR: Emacs 25.3.1 (Org mode 9.1.6)


* LWJGL と OpenCV を Clojure で書いていく
* 動機
  - Lisp っぽいSyntaxで OpenGL とか使ってノベルゲームエンジンを作ってみたい
  - JVM 言語で書けば、どこでも動くんじゃないかな？
  - ゆくゆくは OpenCV + OpenAL も使って動画ファイルを再生したい
  - JavaFX...知らない子ですねぇ

* 出来たこと
  - （OpenCV を Clojure で使うことが出来た）<= まだクロスプラットホームに対応させられていない・・・
  - LWJGL を、 Java のチュートリアルを変換することで使うことが出来た

* 実装方法
  注意：ここの実装方法は、OpenCV の項をクリアした上でなければ動きません・
