doc/lwjgl-clj.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2018-04-17 火 01:56 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>LWJGL と OpenCV を Clojure で書いていく</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Mokke Meguru" />
</head>
<body>
<div id="content">
<h1 class="title">LWJGL と OpenCV を Clojure で書いていく</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org717f748">1. LWJGL と OpenCV を Clojure で書いていく</a></li>
<li><a href="#org00ad718">2. 動機</a></li>
<li><a href="#orgb5b722e">3. 出来たこと</a></li>
<li><a href="#orgeed17a7">4. 実装方法</a>
<ul>
<li><a href="#org804cde6">4.1. Project.clj</a></li>
<li><a href="#orgb37cc2b">4.2. OpenCV</a>
<ul>
<li><a href="#org691d903">4.2.1. OpenCV を Clojure で使う</a></li>
</ul>
</li>
<li><a href="#org86619a4">4.3. LWJGL</a></li>
</ul>
</li>
</ul>
</div>
</div>


<div id="outline-container-org717f748" class="outline-2">
<h2 id="org717f748"><span class="section-number-2">1</span> LWJGL と OpenCV を Clojure で書いていく</h2>
</div>
<div id="outline-container-org00ad718" class="outline-2">
<h2 id="org00ad718"><span class="section-number-2">2</span> 動機</h2>
<div class="outline-text-2" id="text-2">
<ul class="org-ul">
<li>Lisp っぽいSyntaxで OpenGL とか使ってノベルゲームエンジンを作ってみたい</li>
<li>JVM 言語で書けば、どこでも動くんじゃないかな？</li>
<li>ゆくゆくは OpenCV + OpenAL も使って動画ファイルを再生したい</li>
<li>JavaFX&#x2026;知らない子ですねぇ</li>
</ul>
</div>
</div>

<div id="outline-container-orgb5b722e" class="outline-2">
<h2 id="orgb5b722e"><span class="section-number-2">3</span> 出来たこと</h2>
<div class="outline-text-2" id="text-3">
<ul class="org-ul">
<li>（OpenCV を Clojure で使うことが出来た）&lt;= まだクロスプラットホームに対応させられていない・・・</li>
<li>LWJGL を、 Java のチュートリアルを変換することで使うことが出来た</li>
</ul>
</div>
</div>

<div id="outline-container-orgeed17a7" class="outline-2">
<h2 id="orgeed17a7"><span class="section-number-2">4</span> 実装方法</h2>
<div class="outline-text-2" id="text-4">
<p>
注意：ここの実装方法は、OpenCV の項をクリアした上でなければ動きません・
</p>
</div>
