doc/lwjgl-clj.html
<div id="outline-container-org804cde6" class="outline-3">
<h3 id="org804cde6"><span class="section-number-3">4.1</span> Project.clj</h3>
<div class="outline-text-3" id="text-4-1">
<p>
ここが一番重要な部分だと思います。僕ではうまく実装することが出来なかったので、<a href="https://github.com/rogerallen/hello_lwjgl">こちら</a> を参考にさせていただきました。
(おそらく上のページを踏襲してOpenCVも実装すればクロスプラットホームにすることが出来ると思いますが、自分の技術力では出来ませんでした)
また、こちらに関してはまるで何をやっているのかわからないので、解説は出来ません（募：解説）
</p>
<div class="org-src-container">
<pre class="src src-clojure"><span style="color: #4f97d7;">(</span>require '<span style="color: #ce537a; font-weight: bold;">leiningen.core.eval</span><span style="color: #4f97d7;">)</span>

<span style="color: #4f97d7;">(</span><span style="color: #4f97d7; font-weight: bold;">def</span> <span style="color: #7590db;">JVM-OPTS</span>
  <span style="color: #bc6ec5;">{</span><span style="color: #a45bad;">:common</span>   <span style="color: #2d9574;">[]</span>
   <span style="color: #a45bad;">:macosx</span>   <span style="color: #2d9574;">[</span><span style="color: #2d9574;">"-XstartOnFirstThread"</span> <span style="color: #2d9574;">"-Djava.awt.headless=true"</span><span style="color: #2d9574;">]</span>
   <span style="color: #a45bad;">:linux</span>    <span style="color: #2d9574;">[]</span>
   <span style="color: #a45bad;">:windows</span>  <span style="color: #2d9574;">[]</span><span style="color: #bc6ec5;">}</span><span style="color: #4f97d7;">)</span>

<span style="color: #4f97d7;">(</span><span style="color: #4f97d7; font-weight: bold;">defn</span> <span style="color: #bc6ec5; font-weight: bold;">jvm-opts</span>
  <span style="color: #2aa1ae;">"Return a complete vector of jvm-opts for the current os."</span>
  <span style="color: #bc6ec5;">[]</span> <span style="color: #bc6ec5;">(</span><span style="color: #4f97d7; font-weight: bold;">let</span> <span style="color: #2d9574;">[</span>os <span style="color: #67b11d;">(</span><span style="color: #ce537a; font-weight: bold;">leiningen.core.eval</span><span style="color: #b2b2b2; background-color: #292b2e;">/</span>get-os<span style="color: #67b11d;">)</span><span style="color: #2d9574;">]</span>
       <span style="color: #2d9574;">(</span>vec <span style="color: #67b11d;">(</span>set <span style="color: #b1951d;">(</span>concat <span style="color: #4f97d7;">(</span>get JVM-OPTS <span style="color: #a45bad;">:common</span><span style="color: #4f97d7;">)</span>
                         <span style="color: #4f97d7;">(</span>get JVM-OPTS os<span style="color: #4f97d7;">)</span><span style="color: #b1951d;">)</span><span style="color: #67b11d;">)</span><span style="color: #2d9574;">)</span><span style="color: #bc6ec5;">)</span><span style="color: #4f97d7;">)</span>
<span style="color: #4f97d7;">(</span><span style="color: #4f97d7; font-weight: bold;">def</span> <span style="color: #7590db;">LWJGL_NS</span> <span style="color: #2aa1ae;">"org.lwjgl"</span><span style="color: #4f97d7;">)</span>

<span style="color: #2aa1ae; background-color: #292e34;">;; </span><span style="color: #2aa1ae; background-color: #292e34;">Edit this to change the version.</span>
<span style="color: #4f97d7;">(</span><span style="color: #4f97d7; font-weight: bold;">def</span> <span style="color: #7590db;">LWJGL_VERSION</span> <span style="color: #2aa1ae;">"3.1.5"</span><span style="color: #4f97d7;">)</span>

<span style="color: #2aa1ae; background-color: #292e34;">;; </span><span style="color: #2aa1ae; background-color: #292e34;">Edit this to add/remove packages.</span>
<span style="color: #4f97d7;">(</span><span style="color: #4f97d7; font-weight: bold;">def</span> <span style="color: #7590db;">LWJGL_MODULES</span> <span style="color: #bc6ec5;">[</span><span style="color: #2d9574;">"lwjgl"</span>
                    <span style="color: #2d9574;">"lwjgl-assimp"</span>
                    <span style="color: #2d9574;">"lwjgl-bgfx"</span>
                    <span style="color: #2d9574;">"lwjgl-egl"</span>
                    <span style="color: #2d9574;">"lwjgl-glfw"</span>
                    <span style="color: #2d9574;">"lwjgl-jawt"</span>
                    <span style="color: #2d9574;">"lwjgl-jemalloc"</span>
                    <span style="color: #2d9574;">"lwjgl-lmdb"</span>
                    <span style="color: #2d9574;">"lwjgl-lz4"</span>
                    <span style="color: #2d9574;">"lwjgl-nanovg"</span>
                    <span style="color: #2d9574;">"lwjgl-nfd"</span>
                    <span style="color: #2d9574;">"lwjgl-nuklear"</span>
                    <span style="color: #2d9574;">"lwjgl-odbc"</span>
                    <span style="color: #2d9574;">"lwjgl-openal"</span>
                    <span style="color: #2d9574;">"lwjgl-opencl"</span>
                    <span style="color: #2d9574;">"lwjgl-opengl"</span>
                    <span style="color: #2d9574;">"lwjgl-opengles"</span>
                    <span style="color: #2d9574;">"lwjgl-openvr"</span>
                    <span style="color: #2d9574;">"lwjgl-par"</span>
                    <span style="color: #2d9574;">"lwjgl-remotery"</span>
                    <span style="color: #2d9574;">"lwjgl-rpmalloc"</span>
                    <span style="color: #2d9574;">"lwjgl-sse"</span>
                    <span style="color: #2d9574;">"lwjgl-stb"</span>
                    <span style="color: #2d9574;">"lwjgl-tinyexr"</span>
                    <span style="color: #2d9574;">"lwjgl-tinyfd"</span>
                    <span style="color: #2d9574;">"lwjgl-tootle"</span>
                    <span style="color: #2d9574;">"lwjgl-vulkan"</span>
                    <span style="color: #2d9574;">"lwjgl-xxhash"</span>
                    <span style="color: #2d9574;">"lwjgl-yoga"</span>
                    <span style="color: #2d9574;">"lwjgl-zstd"</span><span style="color: #bc6ec5;">]</span><span style="color: #4f97d7;">)</span>

<span style="color: #2aa1ae; background-color: #292e34;">;; </span><span style="color: #2aa1ae; background-color: #292e34;">It's safe to just include all native dependencies, but you might</span>
<span style="color: #2aa1ae; background-color: #292e34;">;; </span><span style="color: #2aa1ae; background-color: #292e34;">save some space if you know you don't need some platform.</span>
<span style="color: #4f97d7;">(</span><span style="color: #4f97d7; font-weight: bold;">def</span> <span style="color: #7590db;">LWJGL_PLATFORMS</span> <span style="color: #bc6ec5;">[</span><span style="color: #2d9574;">"linux"</span> <span style="color: #2d9574;">"macos"</span> <span style="color: #2d9574;">"windows"</span><span style="color: #bc6ec5;">]</span><span style="color: #4f97d7;">)</span>

<span style="color: #2aa1ae; background-color: #292e34;">;; </span><span style="color: #2aa1ae; background-color: #292e34;">These packages don't have any associated native ones.</span>
<span style="color: #4f97d7;">(</span><span style="color: #4f97d7; font-weight: bold;">def</span> <span style="color: #7590db;">no-natives?</span> #<span style="color: #bc6ec5;">{</span><span style="color: #2d9574;">"lwjgl-egl"</span> <span style="color: #2d9574;">"lwjgl-jawt"</span> <span style="color: #2d9574;">"lwjgl-odbc"</span>
                   <span style="color: #2d9574;">"lwjgl-opencl"</span> <span style="color: #2d9574;">"lwjgl-vulkan"</span><span style="color: #bc6ec5;">}</span><span style="color: #4f97d7;">)</span>

<span style="color: #4f97d7;">(</span><span style="color: #4f97d7; font-weight: bold;">defn</span> <span style="color: #bc6ec5; font-weight: bold;">lwjgl-deps-with-natives</span> <span style="color: #bc6ec5;">[]</span>
  <span style="color: #bc6ec5;">(</span>apply concat
         <span style="color: #2d9574;">(</span><span style="color: #4f97d7; font-weight: bold;">for</span> <span style="color: #67b11d;">[</span>m <span style="color: #a45bad;">LWJGL_MODULES</span><span style="color: #67b11d;">]</span>
           <span style="color: #67b11d;">(</span><span style="color: #4f97d7; font-weight: bold;">let</span> <span style="color: #b1951d;">[</span>prefix <span style="color: #4f97d7;">[</span><span style="color: #bc6ec5;">(</span>symbol <span style="color: #a45bad;">LWJGL_NS</span> m<span style="color: #bc6ec5;">)</span> <span style="color: #a45bad;">LWJGL_VERSION</span><span style="color: #4f97d7;">]</span><span style="color: #b1951d;">]</span>
             <span style="color: #b1951d;">(</span>into <span style="color: #4f97d7;">[</span>prefix<span style="color: #4f97d7;">]</span>
                   <span style="color: #4f97d7;">(</span><span style="color: #4f97d7; font-weight: bold;">if</span> <span style="color: #bc6ec5;">(</span>no-natives? m<span style="color: #bc6ec5;">)</span>
                     <span style="color: #bc6ec5;">[]</span>
                     <span style="color: #bc6ec5;">(</span><span style="color: #4f97d7; font-weight: bold;">for</span> <span style="color: #2d9574;">[</span>p <span style="color: #a45bad;">LWJGL_PLATFORMS</span><span style="color: #2d9574;">]</span>
                       <span style="color: #2d9574;">(</span>into prefix <span style="color: #9cb6ad;">[</span><span style="color: #a45bad;">:classifier</span> <span style="color: #4f97d7;">(</span>str <span style="color: #2d9574;">"natives-"</span> p<span style="color: #4f97d7;">)</span>
                                     <span style="color: #a45bad;">:native-prefix</span> <span style="color: #2d9574;">""</span><span style="color: #9cb6ad;">]</span><span style="color: #2d9574;">)</span><span style="color: #bc6ec5;">)</span><span style="color: #4f97d7;">)</span><span style="color: #b1951d;">)</span><span style="color: #67b11d;">)</span><span style="color: #2d9574;">)</span><span style="color: #bc6ec5;">)</span><span style="color: #4f97d7;">)</span>

<span style="color: #4f97d7;">(</span><span style="color: #4f97d7; font-weight: bold;">def</span> <span style="color: #7590db;">all-dependencies</span>
  <span style="color: #bc6ec5;">(</span>into <span style="color: #2aa1ae; background-color: #292e34;">;; </span><span style="color: #2aa1ae; background-color: #292e34;">Add your non-LWJGL dependencies here</span>
   '<span style="color: #2d9574;">[</span><span style="color: #67b11d;">[</span><span style="color: #ce537a; font-weight: bold;">org.clojure</span><span style="color: #b2b2b2; background-color: #292b2e;">/</span>clojure <span style="color: #2d9574;">"1.8.0"</span><span style="color: #67b11d;">]</span>
     <span style="color: #67b11d;">[</span><span style="color: #ce537a; font-weight: bold;">org.clojure</span><span style="color: #b2b2b2; background-color: #292b2e;">/</span>core.async <span style="color: #2d9574;">"0.4.474"</span><span style="color: #67b11d;">]</span>

     <span style="color: #2aa1ae; background-color: #292e34;">;; </span><span style="color: #2aa1ae; background-color: #292e34;">this is for Linux</span>
     <span style="color: #67b11d;">[</span><span style="color: #ce537a; font-weight: bold;">opencv</span><span style="color: #b2b2b2; background-color: #292b2e;">/</span>opencv <span style="color: #2d9574;">"4.0.0"</span><span style="color: #67b11d;">]</span>
     <span style="color: #67b11d;">[</span><span style="color: #ce537a; font-weight: bold;">opencv</span><span style="color: #b2b2b2; background-color: #292b2e;">/</span>opencv-native <span style="color: #2d9574;">"4.0.0"</span><span style="color: #67b11d;">]</span>
     <span style="color: #2d9574;">]</span>
   <span style="color: #2d9574;">(</span>lwjgl-deps-with-natives<span style="color: #2d9574;">)</span><span style="color: #bc6ec5;">)</span><span style="color: #4f97d7;">)</span>


<span style="color: #4f97d7;">(</span><span style="color: #4f97d7; font-weight: bold;">defproject</span> <span style="color: #bc6ec5; font-weight: bold;">clj-lwjgl-vplayer</span> <span style="color: #2d9574;">"0.1.0-SNAPSHOT"</span>
  <span style="color: #a45bad;">:description</span> <span style="color: #2d9574;">"</span><span style="color: #cc9393;">FIXME</span><span style="color: #2d9574;">: write description"</span>
  <span style="color: #a45bad;">:url</span> <span style="color: #2d9574;">"http://example.com/FIXME"</span>
  <span style="color: #a45bad;">:license</span> <span style="color: #bc6ec5;">{</span><span style="color: #a45bad;">:name</span> <span style="color: #2d9574;">"Eclipse Public License"</span>
            <span style="color: #a45bad;">:url</span> <span style="color: #2d9574;">"http://www.eclipse.org/legal/epl-v10.html"</span><span style="color: #bc6ec5;">}</span>
  <span style="color: #a45bad;">:dependencies</span> ~all-dependencies
  <span style="color: #a45bad;">:injections</span> <span style="color: #bc6ec5;">[</span><span style="color: #2d9574;">(</span><span style="color: #ce537a; font-weight: bold;">clojure.lang.RT</span><span style="color: #b2b2b2; background-color: #292b2e;">/</span><span style="color: #bc6ec5;">loadLibrary</span> <span style="color: #ce537a; font-weight: bold;">org.opencv.core.Core</span><span style="color: #b2b2b2; background-color: #292b2e;">/</span><span style="color: #a45bad;">NATIVE_LIBRARY_NAME</span><span style="color: #2d9574;">)</span><span style="color: #bc6ec5;">]</span>
  <span style="color: #a45bad;">:jvm-opts</span> ^<span style="color: #a45bad;">:replace</span> ~<span style="color: #bc6ec5;">(</span>jvm-opts<span style="color: #bc6ec5;">)</span>
  <span style="color: #4f97d7;">)</span>
</pre>
</div>
</div>
</div>
