doc/lwjgl-clj.html

<div id="outline-container-orgb37cc2b" class="outline-3">
<h3 id="orgb37cc2b"><span class="section-number-3">4.2</span> OpenCV</h3>
<div class="outline-text-3" id="text-4-2">
<p>
<a href="https://docs.opencv.org/2.4/doc/tutorials/introduction/clojure_dev_intro/clojure_dev_intro.html">ここ</a> をそのまま使いました。以下は自分がやったことをまとめたものです。
</p>
</div>

<div id="outline-container-org691d903" class="outline-4">
<h4 id="org691d903"><span class="section-number-4">4.2.1</span> OpenCV を Clojure で使う</h4>
<div class="outline-text-4" id="text-4-2-1">
</div>
<ol class="org-ol">
<li><a id="orgf10c14f"></a>Clojure　環境をセットアップしましょう<br />
<div class="outline-text-5" id="text-4-2-1-1">
<p>
Clojureの環境をあなたの開発環境（ex. Mac, Linux）にインストールしてください。
</p>
<ul class="org-ul">
<li><a href="https://github.com/technomancy/leiningen#installation">ここ</a> に従って Leiningen をインストールしましょう</li>
</ul>
<p>
それが終わったら、新しく作業フォルダ (例えば simple-sample) を作成し、そこで <code>lein run</code> コマンドが実行できることを確認してください。
</p>

<div class="org-src-container">
<pre class="src src-text">$ cd path/to/simple-sample
$ lein run

user=&gt;
</pre>
</div>
</div>
</li>

<li><a id="org23fe846"></a>OpenCV をダウンロードしてビルドしましょう<br />
<div class="outline-text-5" id="text-4-2-1-2">
<p>
以下の例に従って OpenCV をビルドしてください。
</p>
<div class="org-src-container">
<pre class="src src-shell">$ mkdir ~/opt
$ cd ~/opt 
$ git clone https://github.com/opencv/opencv.git
$ cd opencv
$ git checkout <span style="color: #a45bad;">3.4.0</span>
$ mkdir build
$ cd build
$ cmake -DBUILD_SHARED_LIBS=OFF ..
...
...
...
make -j8
</pre>
</div>
</div>
</li>
<li><a id="orgf06c42e"></a>Leiningen plugin のツールである localrepo をインストールしましょう<br />
<div class="outline-text-5" id="text-4-2-1-3">
<div class="org-src-container">
<pre class="src src-shell">$ cd ~/.lein
</pre>
</div>
<p>
もし ~/.lein フォルダがない場合には作成してください。
</p>
<div class="org-src-container">
<pre class="src src-shell">$ mkdir ~/.lein
$ cd ~/.lein
</pre>
</div>
<p>
次に、profiles.clj を作成して以下の文を追加してください。
</p>
<div class="org-src-container">
<pre class="src src-clojure"><span style="color: #4f97d7;">{</span><span style="color: #a45bad;">:user</span> <span style="color: #bc6ec5;">{</span><span style="color: #a45bad;">:plugins</span> <span style="color: #2d9574;">[</span><span style="color: #67b11d;">[</span>lein-localrepo <span style="color: #2d9574;">"LATEST"</span><span style="color: #67b11d;">]</span><span style="color: #2d9574;">]</span><span style="color: #bc6ec5;">}</span><span style="color: #4f97d7;">}</span>
</pre>
</div>
<p>
既にファイルがある場合には追記してください。(以下は例)
</p>
<div class="org-src-container">
<pre class="src src-clojure"><span style="color: #4f97d7;">{</span><span style="color: #a45bad;">:user</span> <span style="color: #bc6ec5;">{</span><span style="color: #a45bad;">:plugins</span> <span style="color: #2d9574;">[</span><span style="color: #67b11d;">[</span>lein-cljsbuild <span style="color: #2d9574;">"LATEST"</span><span style="color: #67b11d;">]</span>
             <span style="color: #67b11d;">[</span>lein-figwheel <span style="color: #2d9574;">"LATEST"</span><span style="color: #67b11d;">]</span>
             <span style="color: #67b11d;">[</span>lein-localrepo <span style="color: #2d9574;">"LATEST"</span><span style="color: #67b11d;">]</span> <span style="color: #2aa1ae; background-color: #292e34;">;; </span><span style="color: #2aa1ae; background-color: #292e34;">&#12371;&#12371; </span>
             <span style="color: #67b11d;">[</span><span style="color: #ce537a; font-weight: bold;">luminus</span><span style="color: #b2b2b2; background-color: #292b2e;">/</span>lein-template <span style="color: #2d9574;">"2.9.9.2"</span><span style="color: #67b11d;">]</span><span style="color: #2d9574;">]</span>
   <span style="color: #a45bad;">:dependencies</span> <span style="color: #2d9574;">[</span><span style="color: #67b11d;">[</span><span style="color: #ce537a; font-weight: bold;">org.clojure</span><span style="color: #b2b2b2; background-color: #292b2e;">/</span>tools.nrepl <span style="color: #2d9574;">"LATEST"</span><span style="color: #67b11d;">]</span><span style="color: #2d9574;">]</span><span style="color: #bc6ec5;">}</span><span style="color: #4f97d7;">}</span>
</pre>
</div>
<p>
次に以下のコマンドを実行してください。
</p>
<div class="org-src-container">
<pre class="src src-shell">$ lein deps
</pre>
</div>
</div>
</li>
<li><a id="orgdd9d711"></a>OpenCV を Clojure で使えるようにしましょう<br />
<div class="outline-text-5" id="text-4-2-1-4">
<p>
先程 OpenCV をインストールしたフォルダ <code>~/opt</code> にある以下のファイルが必要になります。
</p>
<ul class="org-ul">
<li>./build/bin/opencv-400.jar</li>
<li>./build/lib/libopencv<sub>java400</sub>.[so/dll/dylib]
Linux で OpenCV をビルドした際には .so 、Mac では dylib 、Windows では dll が見つかると思います。
それぞれの環境で必要になりますので、見つかったそれを使いましょう（逆に言うと、このlibファイルが対応していないOSでは動かないので、つまりこれを用いてクロスプラットフォームなアプリケーションを作るのは難しいということになる・・・のかな？）</li>
</ul>
<p>
　これらのファイルを以下の例に従って配置してください。
</p>
<div class="org-src-container">
<pre class="src src-shell">$ mkdir ~/opencv-to-native
$ cp /path/to/opencv-400.jar ~/opencv-to-native
$ mkdir -p ~/opencv-to-native/native/macosx/x86_64 <span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">&#21508;&#29872;&#22659;&#12395;&#21512;&#12431;&#12379;&#12390;&#12367;&#12384;&#12373;&#12356;</span>
$ cp /path/to/libopencv_java400.dylib <span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">&#21508;&#29872;&#22659;&#12395;&#21512;&#12431;&#12379;&#12390;&#12367;&#12384;&#12373;&#12356;</span>
</pre>
</div>

<p>
以下の表に従って、nativeフォルダに適切なファイルを設置してください。
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">OS</th>
<th scope="col" class="org-left">&#xa0;</th>
<th scope="col" class="org-left">&#xa0;</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">Mac</td>
<td class="org-left">-&gt;</td>
<td class="org-left">macosx</td>
</tr>

<tr>
<td class="org-left">Windows</td>
<td class="org-left">-&gt;</td>
<td class="org-left">windows</td>
</tr>

<tr>
<td class="org-left">Linux</td>
<td class="org-left">-&gt;</td>
<td class="org-left">linux</td>
</tr>

<tr>
<td class="org-left">SunOS</td>
<td class="org-left">-&gt;</td>
<td class="org-left">solaris</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">Architectures</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">amd64</td>
<td class="org-left">-&gt;</td>
<td class="org-left">x86<sub>64</sub></td>
</tr>

<tr>
<td class="org-left">x86<sub>64</sub></td>
<td class="org-left">-&gt;</td>
<td class="org-left">x86<sub>64</sub></td>
</tr>

<tr>
<td class="org-left">x86</td>
<td class="org-left">-&gt;</td>
<td class="org-left">x86</td>
</tr>

<tr>
<td class="org-left">i386</td>
<td class="org-left">-&gt;</td>
<td class="org-left">x86</td>
</tr>

<tr>
<td class="org-left">arm</td>
<td class="org-left">-&gt;</td>
<td class="org-left">arm</td>
</tr>

<tr>
<td class="org-left">sparc</td>
<td class="org-left">-&gt;</td>
<td class="org-left">sparc</td>
</tr>
</tbody>
</table>
</div>
</li>
<li><a id="orga320c03"></a>native library を jar ファイルにパッケージ化しましょう<br />
<div class="outline-text-5" id="text-4-2-1-5">
<p>
以下のコマンドを実行して native-jar を作成してください。
</p>
<div class="org-src-container">
<pre class="src src-shell">$ cd ~/opencv-to-native
$ jar -cMf opencv-native-400.jar native
</pre>
</div>

<p>
これによって以下のような構造が出来上がるはずです。
</p>
<div class="org-src-container">
<pre class="src src-txt">opencv-to-native 
|
|- native 
|  |- macosx 
|     |- x86_64
|        |- libopencv_java400.dylib
|- opencv-400.jar
|- opencv-native-400.jar
</pre>
</div>
</div>
</li>
<li><a id="orgee244e3"></a>leiningen に作成した jar ファイルをインストールしましょう<br />
<div class="outline-text-5" id="text-4-2-1-6">
<p>
以下のコマンドを実行してください。
</p>
<div class="org-src-container">
<pre class="src src-shell">$ cd ~/opencv-to-native
$ lein localrepo install opencv-400.jar opencv/opencv <span style="color: #a45bad;">4.0.0</span>
$ lein localrepo install opencv-native-400.jar opencv/opencv-native <span style="color: #a45bad;">4.0.0</span>
</pre>
</div>
</div>
</li>
<li><a id="org6982e25"></a>追記<br />
<div class="outline-text-5" id="text-4-2-1-7">
<p>
以上であなたの環境でOpenCVをleiningen から簡単に利用することが出来るようになりました。以下に使用例として project.clj を紹介します。
</p>
<div class="org-src-container">
<pre class="src src-clojure">   <span style="color: #4f97d7;">(</span><span style="color: #4f97d7; font-weight: bold;">defproject</span> <span style="color: #bc6ec5; font-weight: bold;">simple-sample</span> <span style="color: #2d9574;">"0.1.0-SNAPSHOT"</span>
<span style="color: #a45bad;">:description</span> <span style="color: #2d9574;">"</span><span style="color: #cc9393;">FIXME</span><span style="color: #2d9574;">: write description"</span>
<span style="color: #a45bad;">:url</span> <span style="color: #2d9574;">"http://example.com/FIXME"</span>
<span style="color: #a45bad;">:license</span> <span style="color: #bc6ec5;">{</span><span style="color: #a45bad;">:name</span> <span style="color: #2d9574;">"Eclipse Public License"</span>
          <span style="color: #a45bad;">:url</span> <span style="color: #2d9574;">"http://www.eclipse.org/legal/epl-v10.html"</span><span style="color: #bc6ec5;">}</span>
<span style="color: #a45bad;">:dependencies</span> <span style="color: #bc6ec5;">[</span><span style="color: #2d9574;">[</span><span style="color: #ce537a; font-weight: bold;">org.clojure</span><span style="color: #b2b2b2; background-color: #292b2e;">/</span>clojure <span style="color: #2d9574;">"1.5.1"</span><span style="color: #2d9574;">]</span>
               <span style="color: #2d9574;">[</span><span style="color: #ce537a; font-weight: bold;">opencv</span><span style="color: #b2b2b2; background-color: #292b2e;">/</span>opencv <span style="color: #a45bad;">4.0.0</span><span style="color: #2d9574;">"]</span>
<span style="color: #2d9574;">               [opencv/opencv-native "</span><span style="color: #a45bad;">4..7</span><span style="color: #2d9574;">"]])</span>
</pre>
</div>
</div>
</li>
<li><a id="org237954c"></a>書いたプログラム<br />
<div class="outline-text-5" id="text-4-2-1-8">
<p>
<a href="http://asukiaaa.blogspot.jp/2017/04/clojureopencv32javaxswing.html">ここ</a> にあるコードを写経しました。
<a href="https://github.com/MokkeMeguru/clj-lwjgl-vplayer/blob/master/src/clj_lwjgl_vplayer/learn_opencv/clj-cv-example.clj">書いたもの</a>
</p>
</div>
</li>
</ol>
</div>
</div>
