doc/lwjgl-clj.html
<div id="outline-container-org86619a4" class="outline-3">
<h3 id="org86619a4"><span class="section-number-3">4.3</span> LWJGL</h3>
<div class="outline-text-3" id="text-4-3">
<p>
<a href="https://github.com/lwjglgamedev/lwjglbook/blob/master/chapter01/src/main/java/org/lwjglb/game/Main.java">ここ</a> のコードを素直にClojureに変換しました。
</p>
<ul class="org-ul">
<li><p>
ネームスペースのあれこれ
必要だったものを適宜追加していきました。
</p>
<div class="org-src-container">
<pre class="src src-clojure">
   <span style="color: #4f97d7;">(</span><span style="color: #4f97d7; font-weight: bold;">ns</span> <span style="color: #ce537a; font-weight: bold;">clj-lwjgl-vplayer.learn-opencv.learn-opengl.first</span>
<span style="color: #bc6ec5;">(</span><span style="color: #a45bad;">:import</span> <span style="color: #2d9574;">(</span><span style="color: #ce537a; font-weight: bold;">org.lwjgl.opengl</span> <span style="color: #a45bad;">GL</span> <span style="color: #ce537a; font-weight: bold;">GL11</span><span style="color: #2d9574;">)</span>
         <span style="color: #2d9574;">(</span><span style="color: #ce537a; font-weight: bold;">org.lwjgl</span> <span style="color: #ce537a; font-weight: bold;">Version</span><span style="color: #2d9574;">)</span>
         <span style="color: #2d9574;">(</span><span style="color: #ce537a; font-weight: bold;">org.lwjgl.glfw</span> <span style="color: #a45bad;">GLFW</span> <span style="color: #ce537a; font-weight: bold;">Callbacks</span>
                         <span style="color: #ce537a; font-weight: bold;">GLFWErrorCallback</span> <span style="color: #ce537a; font-weight: bold;">GLFWKeyCallback</span><span style="color: #2d9574;">)</span><span style="color: #bc6ec5;">)</span><span style="color: #4f97d7;">)</span>
</pre>
</div></li>

<li><p>
パラメータの保持
グローバル変数などはClojureの場合では atom や ref を使うようです。
window に協調性のある ref を使っているのは これを使って Exit 等を判定しているからです。
</p>
<div class="org-src-container">
<pre class="src src-clojure"><span style="color: #4f97d7;">(</span><span style="color: #4f97d7; font-weight: bold;">defonce</span> <span style="color: #7590db;">param</span> <span style="color: #bc6ec5;">(</span>atom <span style="color: #2d9574;">{</span><span style="color: #a45bad;">:width</span> <span style="color: #a45bad;">300</span> <span style="color: #2aa1ae; background-color: #292e34;">;; </span><span style="color: #2aa1ae; background-color: #292e34;">&#19968;&#22238;&#23459;&#35328;&#12377;&#12428;&#12400;&#33391;&#12356;&#12398;&#12391; defonce &#12434;&#20351;&#12387;&#12390;&#12356;&#12414;&#12377;</span>
                      <span style="color: #a45bad;">:height</span> <span style="color: #a45bad;">300</span><span style="color: #2d9574;">}</span><span style="color: #bc6ec5;">)</span><span style="color: #4f97d7;">)</span>

<span style="color: #4f97d7;">(</span><span style="color: #4f97d7; font-weight: bold;">defonce</span> <span style="color: #7590db;">window</span> <span style="color: #bc6ec5;">(</span>ref <span style="color: #a45bad;">0</span><span style="color: #bc6ec5;">)</span><span style="color: #4f97d7;">)</span>

</pre>
</div></li>

<li>run 関数
そのままですね。特に難しいことはないと思いますが、static method の書き方 (Class/static-method) という書き方を思い出すのに少し苦労しました。
loop 関数は　Clojure の標準ライブラリにあるので、loop_ としました。</li>
<li><p>
init 関数
こちらもほとんど変わりませんが、一部難しかった部分があったので詳しく説明しようと思います。
以下の Java コードを見てください。
</p>
<div class="org-src-container">
<pre class="src src-java">glfwSetKeyCallback<span style="color: #4f97d7;">(</span>window, <span style="color: #bc6ec5;">(</span>window, key, scancode, action, mods<span style="color: #bc6ec5;">)</span> -&gt; <span style="color: #bc6ec5;">{</span>
            <span style="color: #4f97d7; font-weight: bold;">if</span> <span style="color: #2d9574;">(</span>key == GLFW_KEY_ESCAPE &amp;&amp; action == GLFW_RELEASE<span style="color: #2d9574;">)</span> <span style="color: #2d9574;">{</span>
                glfwSetWindowShouldClose<span style="color: #67b11d;">(</span>window, <span style="color: #a45bad;">true</span><span style="color: #67b11d;">)</span>; <span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">We will detect this in the rendering loop</span>
            <span style="color: #2d9574;">}</span>
</pre>
</div>
<p>
こちら、lambda 式を使っていますね。これ自体はLispの民としてはとてもうれしいのですが、これを Clojure にどう持ってくるのかが大変難しかったです。
イメージとしてJavaの lambda 式は <code>無名のクラスにつく特定の関数を作る (Overrideする)</code> といった形で、glfwSetKeyCallback の第2引数は GLFWKeyCallback クラスの Invoke となっているようです。（LWJGLのAPI ドキュメントより）
そのため、Clojure 側としては、
</p>
<ol class="org-ol">
<li>GLFWKeyCallback を proxy で実装する</li>
<li><p>
Invoke 関数を作る
が必要となります。
つまり以下のようになるわけです。
</p>
<div class="org-src-container">
<pre class="src src-clojure"><span style="color: #4f97d7;">(</span>proxy <span style="color: #bc6ec5;">[</span><span style="color: #ce537a; font-weight: bold;">GLFWKeyCallback</span><span style="color: #bc6ec5;">]</span> <span style="color: #bc6ec5;">[]</span>
   <span style="color: #bc6ec5;">(</span>invoke <span style="color: #2d9574;">[</span>window k scancode action mods<span style="color: #2d9574;">]</span>
         <span style="color: #2d9574;">(</span><span style="color: #4f97d7; font-weight: bold;">when</span> <span style="color: #67b11d;">(</span><span style="color: #4f97d7; font-weight: bold;">and</span> <span style="color: #b1951d;">(</span>== k <span style="color: #ce537a; font-weight: bold;">GLFW</span><span style="color: #b2b2b2; background-color: #292b2e;">/</span><span style="color: #a45bad;">GLFW_KEY_ESCAPE</span><span style="color: #b1951d;">)</span>
                    <span style="color: #b1951d;">(</span>== action <span style="color: #ce537a; font-weight: bold;">GLFW</span><span style="color: #b2b2b2; background-color: #292b2e;">/</span><span style="color: #a45bad;">GLFW_RELEASE</span><span style="color: #b1951d;">)</span><span style="color: #67b11d;">)</span>
           <span style="color: #67b11d;">(</span><span style="color: #ce537a; font-weight: bold;">GLFW</span><span style="color: #b2b2b2; background-color: #292b2e;">/</span><span style="color: #bc6ec5;">glfwSetWindowShouldClose</span> @window <span style="color: #a45bad;">true</span><span style="color: #67b11d;">)</span><span style="color: #2d9574;">)</span><span style="color: #bc6ec5;">)</span><span style="color: #4f97d7;">)</span>
</pre>
</div></li>
</ol></li>
<li>loop_ 関数 &amp;&amp; -main 関数
そのままです。java の　( A | B ) ってビット演算のことなんですね。すっかり忘れていました。</li>
</ul>
<p>
ソース全体
</p>
<div class="org-src-container">
<pre class="src src-clojure"><span style="color: #4f97d7;">(</span><span style="color: #4f97d7; font-weight: bold;">ns</span> <span style="color: #ce537a; font-weight: bold;">clj-lwjgl-vplayer.learn-opencv.learn-opengl.first</span>
  <span style="color: #bc6ec5;">(</span><span style="color: #a45bad;">:import</span> <span style="color: #2d9574;">(</span><span style="color: #ce537a; font-weight: bold;">org.lwjgl.opengl</span> <span style="color: #a45bad;">GL</span> <span style="color: #ce537a; font-weight: bold;">GL11</span><span style="color: #2d9574;">)</span>
           <span style="color: #2d9574;">(</span><span style="color: #ce537a; font-weight: bold;">org.lwjgl</span> <span style="color: #ce537a; font-weight: bold;">Version</span><span style="color: #2d9574;">)</span>
           <span style="color: #2d9574;">(</span><span style="color: #ce537a; font-weight: bold;">org.lwjgl.glfw</span> <span style="color: #a45bad;">GLFW</span> <span style="color: #ce537a; font-weight: bold;">Callbacks</span>
                           <span style="color: #ce537a; font-weight: bold;">GLFWErrorCallback</span> <span style="color: #ce537a; font-weight: bold;">GLFWKeyCallback</span><span style="color: #2d9574;">)</span><span style="color: #bc6ec5;">)</span><span style="color: #4f97d7;">)</span>

<span style="color: #4f97d7;">(</span><span style="color: #4f97d7; font-weight: bold;">defonce</span> <span style="color: #7590db;">param</span> <span style="color: #bc6ec5;">(</span>atom <span style="color: #2d9574;">{</span><span style="color: #a45bad;">:width</span> <span style="color: #a45bad;">300</span>
                      <span style="color: #a45bad;">:height</span> <span style="color: #a45bad;">300</span><span style="color: #2d9574;">}</span><span style="color: #bc6ec5;">)</span><span style="color: #4f97d7;">)</span>

<span style="color: #4f97d7;">(</span><span style="color: #4f97d7; font-weight: bold;">defonce</span> <span style="color: #7590db;">window</span> <span style="color: #bc6ec5;">(</span>ref <span style="color: #a45bad;">0</span><span style="color: #bc6ec5;">)</span><span style="color: #4f97d7;">)</span>

<span style="color: #4f97d7;">(</span><span style="color: #4f97d7; font-weight: bold;">defn</span> <span style="color: #bc6ec5; font-weight: bold;">run</span> <span style="color: #bc6ec5;">[]</span>
  <span style="color: #bc6ec5;">(</span>println <span style="color: #2d9574;">"Hello LWJGL "</span> +  <span style="color: #2d9574;">(</span><span style="color: #ce537a; font-weight: bold;">Version</span><span style="color: #b2b2b2; background-color: #292b2e;">/</span><span style="color: #bc6ec5;">getVersion</span><span style="color: #2d9574;">)</span><span style="color: #bc6ec5;">)</span>
  <span style="color: #bc6ec5;">(</span><span style="color: #4f97d7; font-weight: bold;">try</span>
    <span style="color: #2d9574;">(</span>init<span style="color: #2d9574;">)</span>
    <span style="color: #2d9574;">(</span>loop_<span style="color: #2d9574;">)</span>
    <span style="color: #2d9574;">(</span><span style="color: #4f97d7; font-weight: bold;">finally</span>
      <span style="color: #67b11d;">(</span><span style="color: #ce537a; font-weight: bold;">Callbacks</span><span style="color: #b2b2b2; background-color: #292b2e;">/</span><span style="color: #bc6ec5;">glfwFreeCallbacks</span> @window<span style="color: #67b11d;">)</span>
      <span style="color: #67b11d;">(</span><span style="color: #bc6ec5;">.free</span> <span style="color: #b1951d;">(</span><span style="color: #ce537a; font-weight: bold;">GLFW</span><span style="color: #b2b2b2; background-color: #292b2e;">/</span><span style="color: #bc6ec5;">glfwSetErrorCallback</span> <span style="color: #a45bad;">nil</span><span style="color: #b1951d;">)</span><span style="color: #67b11d;">)</span><span style="color: #2d9574;">)</span><span style="color: #bc6ec5;">)</span><span style="color: #4f97d7;">)</span>

<span style="color: #4f97d7;">(</span><span style="color: #4f97d7; font-weight: bold;">defn</span> <span style="color: #bc6ec5; font-weight: bold;">init</span> <span style="color: #bc6ec5;">[]</span>
  <span style="color: #bc6ec5;">(</span><span style="color: #bc6ec5;">.set</span> <span style="color: #2d9574;">(</span><span style="color: #ce537a; font-weight: bold;">GLFWErrorCallback</span><span style="color: #b2b2b2; background-color: #292b2e;">/</span><span style="color: #bc6ec5;">createPrint</span> <span style="color: #ce537a; font-weight: bold;">System</span><span style="color: #b2b2b2; background-color: #292b2e;">/</span>err<span style="color: #2d9574;">)</span><span style="color: #bc6ec5;">)</span>
  <span style="color: #bc6ec5;">(</span><span style="color: #4f97d7; font-weight: bold;">when</span> <span style="color: #2d9574;">(</span>not <span style="color: #67b11d;">(</span><span style="color: #ce537a; font-weight: bold;">GLFW</span><span style="color: #b2b2b2; background-color: #292b2e;">/</span><span style="color: #bc6ec5;">glfwInit</span><span style="color: #67b11d;">)</span><span style="color: #2d9574;">)</span>
    <span style="color: #2d9574;">(</span><span style="color: #4f97d7; font-weight: bold;">throw</span> <span style="color: #67b11d;">(</span><span style="color: #ce537a; font-weight: bold;">IllegalStateException.</span> <span style="color: #b1951d;">(</span>str <span style="color: #2d9574;">"Unable to initialize GLFW"</span><span style="color: #b1951d;">)</span><span style="color: #67b11d;">)</span><span style="color: #2d9574;">)</span><span style="color: #bc6ec5;">)</span>
  <span style="color: #bc6ec5;">(</span><span style="color: #ce537a; font-weight: bold;">GLFW</span><span style="color: #b2b2b2; background-color: #292b2e;">/</span><span style="color: #bc6ec5;">glfwDefaultWindowHints</span><span style="color: #bc6ec5;">)</span>
  <span style="color: #bc6ec5;">(</span><span style="color: #ce537a; font-weight: bold;">GLFW</span><span style="color: #b2b2b2; background-color: #292b2e;">/</span><span style="color: #bc6ec5;">glfwWindowHint</span> <span style="color: #ce537a; font-weight: bold;">GLFW</span><span style="color: #b2b2b2; background-color: #292b2e;">/</span><span style="color: #a45bad;">GLFW_VISIBLE</span> <span style="color: #ce537a; font-weight: bold;">GLFW</span><span style="color: #b2b2b2; background-color: #292b2e;">/</span><span style="color: #a45bad;">GLFW_FALSE</span><span style="color: #bc6ec5;">)</span>
  <span style="color: #bc6ec5;">(</span><span style="color: #4f97d7; font-weight: bold;">let</span> <span style="color: #2d9574;">[</span>width <span style="color: #67b11d;">(</span><span style="color: #a45bad;">:width</span> @param<span style="color: #67b11d;">)</span>
        height <span style="color: #67b11d;">(</span><span style="color: #a45bad;">:height</span> @param<span style="color: #67b11d;">)</span><span style="color: #2d9574;">]</span>
    <span style="color: #2d9574;">(</span><span style="color: #4f97d7; font-weight: bold;">dosync</span>
     <span style="color: #67b11d;">(</span>ref-set window <span style="color: #b1951d;">(</span><span style="color: #ce537a; font-weight: bold;">GLFW</span><span style="color: #b2b2b2; background-color: #292b2e;">/</span><span style="color: #bc6ec5;">glfwCreateWindow</span> width height <span style="color: #2d9574;">"Hello World!"</span> <span style="color: #a45bad;">0</span> <span style="color: #a45bad;">0</span><span style="color: #b1951d;">)</span><span style="color: #67b11d;">)</span><span style="color: #2d9574;">)</span>
    <span style="color: #2d9574;">(</span><span style="color: #4f97d7; font-weight: bold;">when</span> <span style="color: #67b11d;">(</span>nil? @window<span style="color: #67b11d;">)</span>
      <span style="color: #67b11d;">(</span><span style="color: #4f97d7; font-weight: bold;">throw</span> <span style="color: #b1951d;">(</span><span style="color: #ce537a; font-weight: bold;">RuntimeException.</span> <span style="color: #2d9574;">"Failed to create GLFW window"</span><span style="color: #b1951d;">)</span><span style="color: #67b11d;">)</span><span style="color: #2d9574;">)</span>
    <span style="color: #2d9574;">(</span><span style="color: #ce537a; font-weight: bold;">GLFW</span><span style="color: #b2b2b2; background-color: #292b2e;">/</span><span style="color: #bc6ec5;">glfwSetKeyCallback</span>
     @window
     <span style="color: #67b11d;">(</span>proxy <span style="color: #b1951d;">[</span><span style="color: #ce537a; font-weight: bold;">GLFWKeyCallback</span><span style="color: #b1951d;">]</span> <span style="color: #b1951d;">[]</span>
       <span style="color: #b1951d;">(</span>invoke <span style="color: #4f97d7;">[</span>window k scancode action mods<span style="color: #4f97d7;">]</span>
         <span style="color: #4f97d7;">(</span><span style="color: #4f97d7; font-weight: bold;">when</span> <span style="color: #bc6ec5;">(</span><span style="color: #4f97d7; font-weight: bold;">and</span> <span style="color: #2d9574;">(</span>== k <span style="color: #ce537a; font-weight: bold;">GLFW</span><span style="color: #b2b2b2; background-color: #292b2e;">/</span><span style="color: #a45bad;">GLFW_KEY_ESCAPE</span><span style="color: #2d9574;">)</span>
                    <span style="color: #2d9574;">(</span>== action <span style="color: #ce537a; font-weight: bold;">GLFW</span><span style="color: #b2b2b2; background-color: #292b2e;">/</span><span style="color: #a45bad;">GLFW_RELEASE</span><span style="color: #2d9574;">)</span><span style="color: #bc6ec5;">)</span>
           <span style="color: #bc6ec5;">(</span><span style="color: #ce537a; font-weight: bold;">GLFW</span><span style="color: #b2b2b2; background-color: #292b2e;">/</span><span style="color: #bc6ec5;">glfwSetWindowShouldClose</span> @window <span style="color: #a45bad;">true</span><span style="color: #bc6ec5;">)</span><span style="color: #4f97d7;">)</span><span style="color: #b1951d;">)</span><span style="color: #67b11d;">)</span><span style="color: #2d9574;">)</span>
    <span style="color: #2d9574;">(</span><span style="color: #4f97d7; font-weight: bold;">let</span> <span style="color: #67b11d;">[</span>vidmode <span style="color: #b1951d;">(</span><span style="color: #ce537a; font-weight: bold;">GLFW</span><span style="color: #b2b2b2; background-color: #292b2e;">/</span><span style="color: #bc6ec5;">glfwGetVideoMode</span> <span style="color: #4f97d7;">(</span><span style="color: #ce537a; font-weight: bold;">GLFW</span><span style="color: #b2b2b2; background-color: #292b2e;">/</span><span style="color: #bc6ec5;">glfwGetPrimaryMonitor</span><span style="color: #4f97d7;">)</span><span style="color: #b1951d;">)</span><span style="color: #67b11d;">]</span>
      <span style="color: #67b11d;">(</span><span style="color: #ce537a; font-weight: bold;">GLFW</span><span style="color: #b2b2b2; background-color: #292b2e;">/</span><span style="color: #bc6ec5;">glfwSetWindowPos</span>
       @window
       <span style="color: #b1951d;">(</span>/ <span style="color: #4f97d7;">(</span>- <span style="color: #bc6ec5;">(</span><span style="color: #bc6ec5;">.width</span> vidmode<span style="color: #bc6ec5;">)</span> width<span style="color: #4f97d7;">)</span> <span style="color: #a45bad;">2</span><span style="color: #b1951d;">)</span>
       <span style="color: #b1951d;">(</span>/ <span style="color: #4f97d7;">(</span>- <span style="color: #bc6ec5;">(</span><span style="color: #bc6ec5;">.height</span> vidmode<span style="color: #bc6ec5;">)</span> height<span style="color: #4f97d7;">)</span> <span style="color: #a45bad;">2</span><span style="color: #b1951d;">)</span><span style="color: #67b11d;">)</span><span style="color: #2d9574;">)</span>
    <span style="color: #2d9574;">(</span><span style="color: #ce537a; font-weight: bold;">GLFW</span><span style="color: #b2b2b2; background-color: #292b2e;">/</span><span style="color: #bc6ec5;">glfwMakeContextCurrent</span> @window<span style="color: #2d9574;">)</span>
    <span style="color: #2d9574;">(</span><span style="color: #ce537a; font-weight: bold;">GLFW</span><span style="color: #b2b2b2; background-color: #292b2e;">/</span><span style="color: #bc6ec5;">glfwSwapInterval</span> <span style="color: #a45bad;">1</span><span style="color: #2d9574;">)</span>
    <span style="color: #2d9574;">(</span><span style="color: #ce537a; font-weight: bold;">GLFW</span><span style="color: #b2b2b2; background-color: #292b2e;">/</span><span style="color: #bc6ec5;">glfwShowWindow</span> @window<span style="color: #2d9574;">)</span><span style="color: #bc6ec5;">)</span><span style="color: #4f97d7;">)</span>

<span style="color: #4f97d7;">(</span><span style="color: #4f97d7; font-weight: bold;">defn</span> <span style="color: #bc6ec5; font-weight: bold;">loop_</span> <span style="color: #bc6ec5;">[]</span>
  <span style="color: #bc6ec5;">(</span><span style="color: #ce537a; font-weight: bold;">GL</span><span style="color: #b2b2b2; background-color: #292b2e;">/</span><span style="color: #bc6ec5;">createCapabilities</span><span style="color: #bc6ec5;">)</span>
  <span style="color: #bc6ec5;">(</span><span style="color: #ce537a; font-weight: bold;">GL11</span><span style="color: #b2b2b2; background-color: #292b2e;">/</span><span style="color: #bc6ec5;">glClearColor</span> <span style="color: #a45bad;">1.0</span> <span style="color: #a45bad;">0.0</span> <span style="color: #a45bad;">0.0</span> <span style="color: #a45bad;">0.0</span><span style="color: #bc6ec5;">)</span>
  <span style="color: #bc6ec5;">(</span>while <span style="color: #2d9574;">(</span>not <span style="color: #67b11d;">(</span><span style="color: #ce537a; font-weight: bold;">GLFW</span><span style="color: #b2b2b2; background-color: #292b2e;">/</span><span style="color: #bc6ec5;">glfwWindowShouldClose</span> @window<span style="color: #67b11d;">)</span><span style="color: #2d9574;">)</span>
    <span style="color: #2d9574;">(</span><span style="color: #ce537a; font-weight: bold;">GL11</span><span style="color: #b2b2b2; background-color: #292b2e;">/</span><span style="color: #bc6ec5;">glClear</span>
     <span style="color: #67b11d;">(</span>bit-or <span style="color: #ce537a; font-weight: bold;">GL11</span><span style="color: #b2b2b2; background-color: #292b2e;">/</span><span style="color: #a45bad;">GL_COLOR_BUFFER_BIT</span>  <span style="color: #ce537a; font-weight: bold;">GL11</span><span style="color: #b2b2b2; background-color: #292b2e;">/</span><span style="color: #a45bad;">GL_DEPTH_BUFFER_BIT</span><span style="color: #67b11d;">)</span><span style="color: #2d9574;">)</span>
    <span style="color: #2d9574;">(</span><span style="color: #ce537a; font-weight: bold;">GLFW</span><span style="color: #b2b2b2; background-color: #292b2e;">/</span><span style="color: #bc6ec5;">glfwSwapBuffers</span> @window<span style="color: #2d9574;">)</span>
    <span style="color: #2d9574;">(</span><span style="color: #ce537a; font-weight: bold;">GLFW</span><span style="color: #b2b2b2; background-color: #292b2e;">/</span><span style="color: #bc6ec5;">glfwPollEvents</span><span style="color: #2d9574;">)</span><span style="color: #bc6ec5;">)</span><span style="color: #4f97d7;">)</span>

<span style="color: #4f97d7;">(</span><span style="color: #4f97d7; font-weight: bold;">defn</span> <span style="color: #bc6ec5; font-weight: bold;">-main</span> <span style="color: #bc6ec5;">[]</span>
  <span style="color: #bc6ec5;">(</span>run<span style="color: #bc6ec5;">)</span><span style="color: #4f97d7;">)</span>

<span style="color: #4f97d7;">(</span>-main<span style="color: #4f97d7;">)</span>
</pre>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: 2018-04-17 火 00:00</p>
<p class="author">Author: Mokke Meguru</p>
<p class="date">Created: 2018-04-17 火 01:56</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
